<?
$MESS["WIZ_DEFAULT_USER_CONSENT_NAME"] = "Согласие на обработку персональных данных";
$MESS["REDSIGN_AGREEMENT_TEXT"] = "Согласие на обработку персональных данных\n
\n
Настоящим в соответствии с Федеральным законом № 152-ФЗ «О персональных данных» от 27.07.2006 года свободно, своей волей и в своем интересе выражаю свое безусловное согласие на обработку моих персональных данных <Название_компании>, зарегистрированным в соответствии с законодательством РФ по адресу:\n
<Адрес_регистрации_компании> (далее по тексту - Оператор).\n
Персональные данные - любая информация, относящаяся к определенному или определяемому на основании такой информации физическому лицу.\n
Настоящее Согласие выдано мною на обработку следующих персональных данных:\n
Список полей формы\n
\n
Согласие дано Оператору для совершения следующих действий с моими персональными данными с использованием средств автоматизации и/или без использования таких средств: сбор, систематизация, накопление, хранение, уточнение (обновление, изменение), использование, обезличивание, передача третьим лицам для указанных ниже целей, а также осуществление любых иных действий, предусмотренных действующим законодательством РФ как неавтоматизированными, так и автоматизированными способами.\n
Данное согласие дается Оператору и третьему лицу(-ам) <Информация_передается_третьим_лицам> для обработки моих персональных данных в следующих целях:\n
<Указать_свой_вариант_использования_персональных_данных>\n
\n
Настоящее согласие действует до момента его отзыва путем направления соответствующего уведомления на электронный адрес <EMAIL-адрес_для_жалоб>. В случае отзыва мною согласия на обработку персональных данных Оператор вправе продолжить обработку персональных данных без моего согласия при наличии оснований, указанных в пунктах 2 – 11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального закона №152-ФЗ «О персональных данных» от 27.06.2006 г.";
$MESS["REDSIGN_AGREEMENT_LABEL_TEXT"] = "Соглашаюсь на обработку  <a href=\"#URL#\" target=\"__blank\" onclick=\"event.stopPropagation();\">персональных данных</a>";
$MESS["REDSIGN_COPYRIGHT"] = "Удаление ссылки на разработчика является грубым нарушением лицензионного соглашения и может являться причиной отказа в оказании технической поддержки.";
?>