<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Сниппеты");
?>
<h2>Что такое сниппеты</h2>
<p>
	 Сниппеты - это визуально оформленные блоки, состоящие, как правило, из текста и графических элементов. Эти блоки вы можете вставлять в любое место редактируемой страницы, повышая читабельность текста и добиваясь единого стиля оформления.
</p>
<p>
	 Заходите на сайт, как администратор, включайте режим правки. Переходите к странице, где будете форматировать или писать текст. Через всплывающую панель заходите в визуальный редактор, в правой части панели открывайте сниппеты и начните перетаскивать их мышью на страницу. Обещаем, вам понравится.
</p>
<p>
	 Сейчас в нашем решении несколько сниппетов, вот они: <br>
</p>
<ul class="custom-list-ul">
	<li>Изображение с текстом слева</li>
	<li>Изображение с текстом справа</li>
	<li>Изображение по центру</li>
	<li>Нумерованный список</li>
	<li>Маркированный список</li>
	<li>Врезка текста</li>
	<li>Врезка текста с делителем</li>
	<li>Врезка текста на фоне</li>
	<li>Цитата</li>
</ul>
<p>
	 Пробежимся по каждому снипету и посмотрим, что он может и когда его следует использовать.
</p>
<p>
 <br>
</p>
<h2>Текст + изображение</h2>
<p>
	 Лучше 1 раз увидеть, чем сто раз услышать. Для добавления текста, иллюстрированного изображениями можно использовать снипеты &nbsp;<i>“Изображение с текстом слева”</i> и <i>“Изображение с текстом справа”</i>, а также сниппет <i>“Изображение по центру”</i>, которые можно вставить в любой текст.&nbsp;
</p>
<p>
	 Для работы с такими сниппетами визуальном редакторе рекомендуем развернуть редактор во весь экран, используя соответствующий значок с четырьмя разнонаправленными стрелками на панели визуального редактора.<br>
</p>
<div class="block-margin-y block-spacing-negative-x text-center text-lg-left">
	<div class="d-lg-flex align-items-center">
		<div class="d-block flex-grow-0 flex-shrink-0 order-2">
 <img src="http://static.redsign.ru/demo-content/megamart/articles/_all/600x380.png">
			<div class="py-3">
				 Сниппет: изображение с текстом слева<br>
 <span class="text-muted small">Источник фото: в этом поле можно указать источник</span>
			</div>
		</div>
		<div class="d-block block-spacing-x pb-lg-7 flex-grow-1 flex-shrink-1 order-1">
 <span class="text-muted font-size-big">Изображение с текстом слева</span>
			<p class="mt-3">
				 В этом поле, как правило, приводится текст, который иллюстрирует фотография. Обратите внимание, что лучше использовать изображение с соотношением сторон 600 на 380 пикселей.&nbsp;
			</p>
		</div>
	</div>
</div>
<div class="block-margin-y block-spacing-negative-x text-center text-lg-left">
	<div class="d-lg-flex align-items-center">
		<div class="d-block flex-grow-0 flex-shrink-0">
 <img src="http://static.redsign.ru/demo-content/megamart/articles/_all/600x380.png">
			<div class="block-spacing py-3">
				 Сниппет: изображение с текстом справа<br>
 <span class="text-muted small">Источник фото: в этом поле можно указать источник</span>
			</div>
		</div>
		<div class="d-block block-spacing-x pb-lg-7 flex-grow-1 flex-shrink-1">
			<h3>Изображение с текстом справа</h3>
			<hr class="mx-auto mx-lg-0 title-delimiter">
 <span class="text-muted font-size-big">Поле для подзаголовка</span>
			<p class="mt-3">
				 От сниппета с изображением слева блок отличается тем, что в нем есть дополнительное поле <b>подзаголовка</b>, которое может проставить дополнительный акцент.
			</p>
		</div>
	</div>
</div>
<p>
	 И последним блоком, который вам может помочь добавить изображение в текст является сниппет - <i>Изображение по центру</i>. Он удобен тем, что занимает всю ширину редактируемой области и не требует каких-либо подписей. Т.е. является самостоятельным.
</p>
<p>
	 Этот сниппет придется кстати при подготовке обзоров, статей и отчетов с мероприятий. Рекомендуемый размер для фото 1200 на 560 пикселей.
</p>
 <br>
<div class="block-spacing-negative-x block-margin-y">
 <img src="http://static.redsign.ru/demo-content/megamart/articles/_all/1200x560.png">
	<div class="block-spacing py-3">
		 Сниппет: изображение по центру<br>
 <span class="text-muted small">Источник фото: здесь можно указать источник фотографии или автора</span>
	</div>
</div>
<h2>Упорядоченный список </h2>
<p>
	 Если в тексте вам нужно сделать акцент на количестве пунктов, перечислении используйте синиппеты&nbsp;“<i>Нумерованный список</i>” и&nbsp;“<i>Маркированный список</i>”. В нумерованном списке пункты будут пронумерованы, а в маркированном? - Правильно! Промаркированы.
</p>
<p>
	 Применение нумерованного списка&nbsp;позволит: <br>
</p>
<ol class="custom-list-ol">
	<li>Систематизировать информацию</li>
	<li>Наглядно представить несколько видом перечислений</li>
	<li>
	Расставить нужные акценты
	<ol>
		<li>Особенно если таких акцентов много</li>
		<li>Эти акценты иерархичны</li>
		<li>И могут быть представлены в виде списка</li>
	</ol>
 </li>
	<li>Повысить читабельность текста</li>
</ol>
<p>
	 Когда список внушителен рекомендуется делать нумерованные списки. Когда же нужно выделить 3-5 преимуществ товара, то используйте маркированный список, который выглядит вот так:<br>
</p>
<ul class="custom-list-ul">
	<li>Гарантия качества</li>
	<li>Бесплатная доставка</li>
	<li>Кэшбэк от суммы покупок</li>
	<li>Обмен и возврат в течение 50 дней</li>
</ul>
 <br>
<h2>Врезка текста</h2>
<p>
	 Просмотр страниц заключается прежде всего <b>в поиске ключевых слов и фраз</b>. Хорошо составленные, продуманные врезки, расставленные по тексту, играют роль неформального конспекта или содержания страницы. Они сообщают, о чем говорится в каждом разделе текста, выделяют главную мысль, а если они не буквальные, то это может заинтриговать.
</p>
<div class="text-insert">
	 Хорошо составленные, продуманные врезки, расставленные по тексту, играют роль неформального конспекта или содержания страницы.<br>
</div>
<p>
	 Обратите внимание, что когда большое количество текста не проиллюстрировано, его становится утомительно читать. Сразу вспоминаем сниппет "Изображение по центру" и вставляем его.&nbsp;<br>
</p>
<div class="block-spacing-negative-x block-margin-y">
 <img src="http://static.redsign.ru/demo-content/megamart/articles/_all/1200x560.png">
	<div class="block-spacing py-3">
		 Название или описание изображения<br>
 <span class="text-muted small">Источник фото: агенство новостей ART</span>
	</div>
</div>
 <br>
<h2>Врезка текста с делителем</h2>
<p>
	 В любом случае, врезки помогают вам принять решение, какие части текста прочитать, какие - просмотреть, а какие - пропустить.
</p>
<div class="block-spacing-negative-x block-margin-y block-spacing-x">
	<div class="text-emphasis text-emphasis--delimiter">
		<div class="text-emphasis__content">
			<h2 class="text-emphasis__title">Основная мысль текста</h2>
			<hr class="title-delimiter mx-auto">
			 Хорошо составленные, продуманные врезки, расставленные по тексту, играют роль неформального конспекта или содержания страницы.<br>
		</div>
	</div>
</div>
<h2>Врезка текста на фоне</h2>
<p>
	 Это еще одна разновидность текстовой врезки с делителем, выполненной на цветном фоне. Напомним, что просмотр страниц заключается прежде всего в поиске ключевых слов и фраз.&nbsp;
</p>
<div class="mark block-spacing-negative-x block-margin-y block-spacing-x">
	<div class="text-emphasis ">
		<div class="text-emphasis__content">
			<h2 class="text-emphasis__title">Главная мысль</h2>
			<hr class="title-delimiter mx-auto">
			 Просмотр страниц заключается прежде всего в поиске ключевых слов и фраз<br>
		</div>
	</div>
</div>
<p>
	 Хорошо составленные, продуманные врезки, расставленные по тексту, играют роль неформального конспекта или содержания страницы.
</p>
<h2>Цитата</h2>
<p>
	 Здесь много описывать не нужно. Просто берем и добавляем цитату в нужный нам текст.
</p>
<p class="mb-0">
	 Гомолог, если рассматривать процессы в рамках специальной теории относительности, летуч. Окисление ингибирует спирт. Фрактал периодически восстанавливает бесцветный бугор пучения.
</p>
 <footer class="blockquote-custom-footer">Сказал один великий ученый в XIX веке.</footer>

<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>