<h3>Вы можете создавать несколько корзин!	</h3>
<p>Мы заботимся о наших покупателях и стараемся делать сайт максимально удобным. Теперь, чтобы не путать покупки для разных целей — создавайте новые корзины, добавляйте в них нужные товары и оформляйте заказы. </p>
<p>Дополнительные корзины можно создать в основной корзине. Нажмите значок “+” рядом с основной корзиной, придумайте название и выберите цвет для новой корзины. Готово!</p>
<p>Если создано больше одной корзины, то между ними можно переключаться в основной корзине.</p>
<img src="/include/templates/cart/sharecart1.png" class="img-fluid mb-7" alt="Создание новой корзины" title="Создание новой корзины">
<h3>Делитесь своими корзинами</h3>
<p>А еще вы можете поделиться любой корзиной с друзьями, знакомыми и близкими. Просто скопируйте ссылку на корзину и перешлите её любым способом . По клику на ссылку создастся точно такая же корзина и из нее можно оформить заказ. </p>
<img src="/include/templates/cart/sharecart2.png" class="img-fluid mb-7" alt="Назначьте цвет корзины" title="Назначьте новой корзины">